target/test-classes/data/Sample.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:even="http://www.thegoldensource.com/EventRaiserService.wsdl">
    <soapenv:Header/>
    <soapenv:Body>
        <even:RaiseASX_EVT_PublishTRETBatchSynchron/>
    </soapenv:Body>
</soapenv:Envelope>